w = input("Enter your weight (KG) : ")
h = input("Enter your height (M) : ")
w = float(w)
h = float(h)

b = w/((h)*(h))
print(f"Your BMI is {round(b,2)}")
final_result = ""


# อ้วนมาก = 30.0 ขึ้นไป
# ค่อนข้างอันตราย เสี่ยงต่อการเกิดโรคร้ายแรงที่แฝงมากับความอ้วน หากค่า BMI อยู่ในระดับนี้ จะต้องปรับพฤติกรรมการทานอาหาร และควรเริ่มออกกำลังกาย และหากเลขยิ่งสูงกว่า 40.0 ยิ่งแสดงถึงความอ้วนที่มากขึ้น ควรไปตรวจสุขภาพ และปรึกษาแพทย์

# อ้วน = 25.0 - 29.9
# อ้วนในระดับหนึ่ง ถึงแม้จะไม่ถึงเกณฑ์ที่ถือว่าอ้วนมาก ๆ แต่ก็ยังมีความเสี่ยงต่อการเกิดโรคที่มากับความอ้วนได้เช่นกัน ทั้งโรคเบาหวาน และความดันโลหิตสูง ควรปรับพฤติกรรมการทานอาหาร ออกกำลังกาย และตรวจสุขภาพ

# น้ำหนักปกติ เหมาะสม = 18.6 - 24
# น้ำหนักที่เหมาะสมสำหรับคนไทยคือค่า BMI ระหว่าง 18.5-24 จัดอยู่ในเกณฑ์ปกติ ห่างไกลโรคที่เกิดจากความอ้วน และมีความเสี่ยงต่อการเกิดโรคต่าง ๆ น้อยที่สุด ควรพยายามรักษาระดับค่า BMI ให้อยู่ในระดับนี้ให้นานที่สุด และควรตรวจสุขภาพทุกปี

# ผอมเกินไป = น้อยกว่า 18.5


if b >= 30:
    final_result = "อ้วนมาก"
elif b >= 25:
    final_result = "อ้วน"
elif b >= 18.6:
    final_result = "น้ำหนักปกติ"
else:
    final_result = "ผอมเกินไป"


print(f"Your body is : {final_result}")